/distrib.texi/1.2/Sat Jul 22 19:24:36 2006//
/distrib.texi/1.2/Sat Jul 22 19:24:36 2006//
@c Language: Brazilian Portuguese, Encoding: iso-8859-1
@c /distrib.texi/1.2/Sat Jul 22 19:24:36 2006//
@menu
* Introdu@value{cedilha}@~ao a distrib::
* Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes cont@'inuas::
* Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes discretas::
@end menu

@node Introdu@value{cedilha}@~ao a distrib, Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes cont@'inuas, distrib, distrib
@section Introdu@value{cedilha}@~ao a distrib


Pacote @code{distrib} cont@'em um conjunto de fun@,{c}@~oes para fazer c@'alculos envolvendo probabilidades de modelos de uma @'unica vari@'avel e de ambos os tipos discreta e cont@'inua. 

O que segue @'e um curto resumo de defini@,{c}oes b@'asicas relacionadas @`a teoria das probabilidades.

Seja @math{f(x)} a @var{fun@,{c}@~ao densidade de probabilidade} absoluta de uma vari@'avel aleat@'oria cont@'inua @math{X}. A @var{fun@,{c}@~ao distribui@,{c}@~ao de probabilidade} @'e definida como
@ifhtml
@example
                       x
                      /
                      [
               F(x) = I     f(u) du
                      ]
                      /
                       minf
@end example
@end ifhtml
@ifinfo
@example
                       x
                      /
                      [
               F(x) = I     f(u) du
                      ]
                      /
                       minf
@end example
@end ifinfo
@tex
$$F\left(x\right)=\int_{ -\infty }^{x}{f\left(u\right)\;du}$$
@end tex
que @'e igual @`a probabilidade @var{Pr(X <= x)}.

O valor @var{m@'edio} @'e um par@^ametro de localiza@,{c}@~ao e est@'a definido como
@ifhtml
@example
                     inf
                    /
                    [
           E[X]  =  I   x f(x) dx
                    ]
                    /
                     minf
@end example
@end ifhtml
@ifinfo
@example
                     inf
                    /
                    [
           E[X]  =  I   x f(x) dx
                    ]
                    /
                     minf
@end example
@end ifinfo
@tex
$$E\left[X\right]=\int_{ -\infty }^{\infty }{x\,f\left(x\right)\;dx}$$
@end tex

A @var{vari@^ancia} @'e uma medida de varia@,{c}@~ao,
@ifhtml
@example
                 inf
                /
                [                    2
         V[X] = I     f(x) (x - E[X])  dx
                ]
                /
                 minf
@end example
@end ifhtml
@ifinfo
@example
                 inf
                /
                [                    2
         V[X] = I     f(x) (x - E[X])  dx
                ]
                /
                 minf
@end example
@end ifinfo
@tex
$$V\left[X\right]=\int_{ -\infty }^{\infty }{f\left(x\right)\,\left(x
 -E\left[X\right]\right)^2\;dx}$$
@end tex
que @'e um n@'umero real positivo. A ra@'iz quadrada da vari@^ancia @'e o @var{desvio padr@~ao}, @math{D[X]=sqrt(V[X])}, e esse @var{desvio padr@~ao} @'e outra medida de varia@,{c}@~ao.

The @var{coeficiente de assimetria} @'e uma medida de n@~ao simetria,
@ifhtml
@example
                 inf
                /
            1   [                    3
  SK[X] = ----- I     f(x) (x - E[X])  dx
              3 ]
          D[X]  /
                 minf
@end example
@end ifhtml
@ifinfo
@example
                 inf
                /
            1   [                    3
  SK[X] = ----- I     f(x) (x - E[X])  dx
              3 ]
          D[X]  /
                 minf
@end example
@end ifinfo
@tex
$$SK\left[X\right]={{\int_{ -\infty }^{\infty }{f\left(x\right)\,
 \left(x-E\left[X\right]\right)^3\;dx}}\over{D\left[X\right]^3}}$$
@end tex

E o @var{coeficiente de curtose} mede o grau de achatamento de uma distribui@,{c}@~ao,
@ifhtml
@example
                 inf
                /
            1   [                    4
  KU[X] = ----- I     f(x) (x - E[X])  dx - 3
              4 ]
          D[X]  /
                 minf
@end example
@end ifhtml
@ifinfo
@example
                 inf
                /
            1   [                    4
  KU[X] = ----- I     f(x) (x - E[X])  dx - 3
              4 ]
          D[X]  /
                 minf
@end example
@end ifinfo
@tex
$$KU\left[X\right]={{\int_{ -\infty }^{\infty }{f\left(x\right)\,
 \left(x-E\left[X\right]\right)^4\;dx}}\over{D\left[X\right]^4}}-3$$
@end tex
Se @math{X} for gaussiana, @math{KU[X]=0}. De fato, ambos assimetria e curtose s@~ao par@^ametros de ajuste usados para medir a n@~ao gaussianidade de uma distribui@,{c}@~ao.

Se a vari@'avel aleat@'oria @math{X} for discreta, a fun@,{c}@~ao densidade de probabilidade, ou simplesmente @var{probabilidade}, @math{f(x)} toma valores positivos dentro de certos conjuntos cont@'aveis de n@'umeros @math{x_i},
e zero em
caso contr@'ario. Nesse caso, a fun@,{c}@~ao
distribui@,{c}@~ao de probabilidade @'e
@ifhtml
@example
                       ====
                       \
                F(x) =  >    f(x )
                       /        i
                       ====
                      x <= x
                       i
@end example
@end ifhtml
@ifinfo
@example
                       ====
                       \
                F(x) =  >    f(x )
                       /        i
                       ====
                      x <= x
                       i
@end example
@end ifinfo
@tex
$$F\left(x\right)=\sum_{x_{i}\leq x}{f\left(x_{i}\right)}$$
@end tex

A m@'edia, vari@^ancia, desvio padr@~ao, coeficiente de assimetria e coeficiente de curtose tomam a forma
@ifhtml
@example
                       ====
                       \
                E[X] =  >  x  f(x ) ,
                       /    i    i
                       ====
                        x 
                         i
@end example
@end ifhtml
@ifinfo
@example
                       ====
                       \
                E[X] =  >  x  f(x ) ,
                       /    i    i
                       ====
                        x 
                         i
@end example
@end ifinfo
@tex
$$E\left[X\right]=\sum_{x_{i}}{x_{i}f\left(x_{i}\right)},$$
@end tex

@ifhtml
@example
                ====
                \                     2
        V[X] =   >    f(x ) (x - E[X])  ,
                /        i    i
                ====
                 x
                  i
@end example
@end ifhtml
@ifinfo
@example
                ====
                \                     2
        V[X] =   >    f(x ) (x - E[X])  ,
                /        i    i
                ====
                 x
                  i
@end example
@end ifinfo
@tex
$$V\left[X\right]=\sum_{x_{i}}{f\left(x_{i}\right)\left(x_{i}-E\left[X\right]\right)^2},$$
@end tex

@ifhtml
@example
               D[X] = sqrt(V[X]),
@end example
@end ifhtml
@ifinfo
@example
               D[X] = sqrt(V[X]),
@end example
@end ifinfo
@tex
$$D\left[X\right]=\sqrt{V\left[X\right]},$$
@end tex

@ifhtml
@example
                     ====
              1      \                     3
  SK[X] =  -------    >    f(x ) (x - E[X])  
           D[X]^3    /        i    i
                     ====
                      x
                       i
@end example
@end ifhtml
@ifinfo
@example
                     ====
              1      \                     3
  SK[X] =  -------    >    f(x ) (x - E[X])  
           D[X]^3    /        i    i
                     ====
                      x
                       i
@end example
@end ifinfo
@tex
$$SK\left[X\right]={{\sum_{x_{i}}{f\left(x\right)\,
 \left(x-E\left[X\right]\right)^3\;dx}}\over{D\left[X\right]^3}}$$
@end tex
and
@ifhtml
@example
                     ====
              1      \                     4
  KU[X] =  -------    >    f(x ) (x - E[X])   - 3 ,
           D[X]^4    /        i    i
                     ====
                      x
                       i
@end example
@end ifhtml
@ifinfo
@example
                     ====
              1      \                     4
  KU[X] =  -------    >    f(x ) (x - E[X])   - 3 ,
           D[X]^4    /        i    i
                     ====
                      x
                       i
@end example
@end ifinfo
@tex
$$KU\left[X\right]={{\sum_{x_{i}}{f\left(x\right)\,
 \left(x-E\left[X\right]\right)^4\;dx}}\over{D\left[X\right]^4}}-3,$$
@end tex
respectively.

O Pacote @code{distrib} inclui fun@,{c}@~oes para simula@,{c}@~ao de vari@'aveis aleat@'orias. Algumas dessas fun@,{c}@~oes fazem uso de vari@'aveis opcionais que indicam o algor@'itmo a ser usado. O m@'etodo inverso geral
(baseado no fato que
se
@var{u} for um n@'umero aleat@'orio uniforme no intervalo @math{(0,1)}, ent@~ao @var{F^(-1)(u)} @'e uma vari@'avel aleat@'oria com distribui@,{c}@~ao @math{F}) est@'a implementada para a maioria dos casos; isso @'e um m@'etodo
sub@'otimo em termos de
cronometragem, mas @'util para fazer compara@,{c}@~oes
com outros algor@'itmos. Nesse exemplo, a @code{perandom_formance} dos algor@'itmos @code{ahrens_cheng} e @code{inverse} em simular  vari@'aveis chi-quadradas (letra grega "chi") S@`ao comparadas por meio de seus histogramas:

@example
(%i1) load(distrib)$
(%i2) load(descriptive)$
(%i3) showtime: true$
Evaluation took 0.00 seconds (0.00 elapsed) using 32 bytes.
(%i4) random_chi2_algorithm: 'ahrens_cheng$ histogram(random_chi2(10,500))$
Evaluation took 0.00 seconds (0.00 elapsed) using 40 bytes.
Evaluation took 0.69 seconds (0.71 elapsed) using 5.694 MB.
(%i6) random_chi2_algorithm: 'inverse$ histogram(random_chi2(10,500))$
Evaluation took 0.00 seconds (0.00 elapsed) using 32 bytes.
Evaluation took 10.15 seconds (10.17 elapsed) using 322.098 MB.
@end example

Com o objetivo de fazer compara@,{c}@~oes visuais entre algor@'itmos para uma vari@'avel discreta, a fun@,{c}@~ao @code{barsplot} do pacote @code{descriptive} pode ser usada.

Note que algum trabalho resta para ser realizado, uma vez que essas fun@,{c}@~oes de simula@,{c}@~ao n@~ao foram ainda verificadas pelos mais rigorosamente melhores dos testes de ajuste.

Por favor, consulte um manual introdut@'orio sobre probabilidade e estat@'istica para maiores informa@,{c}@~oes sobre todo esse material matem@'atico.

Existe uma conven@,{c}@~ao de nome no pacote @code{distrib}. Todo nome de  fun@,{c}@~ao tem duas partes, a primeira faz refer@^encia @`a fun@,{c}@~ao ou ao par@^ametro que queremos calcular,
@example
Fun@value{cedilha}@~oes:
   fun@,{c}@~ao densidade de probabilidade            (pdf_*)
   fun@,{c}@~ao distribui@,{c}@~ao de probabilidade       (cdf_*)
   Quartil                    (quantile_*)
   M@'edia                        (mean_*)
   Vari@^ancia                    (var_*)
   Desvio padr@~ao          (std_*)
   Coeficiente de assimetria        (skewness_*)
   Coeficiente de curtose        (kurtosis_*)
   Vari@'avel aleat@'oria              (random_*)
@end example

A segunda parte é uma referência explícita ao modelo probabilístico,
@example
Distribuíções contínuas:
   Normal              (*normal)
   Student             (*student_t)
   Chi^2               (*chi2)
   F                   (*f)
   Exponencial         (*exp)
   Lognormal           (*lognormal)
   Gama               (*gamma)
   Beta                (*beta)
   cont@'inua uniforme  (*continuous_uniform)
   Logística            (*logistic)
   Pareto              (*pareto)
   Weibull             (*weibull)
   Rayleigh            (*rayleigh)
   Laplace             (*laplace)
   Cauchy              (*cauchy)
   Gumbel              (*gumbel)

Distribuições discretas:
   Binomial             (*binomial)
   Poisson              (*poisson)
   Bernoulli            (*bernoulli)
   Geométrica            (*geometric)
   discreta uniforme     (*discrete_uniform)
   hipergeométrica       (*hypergeometric)
   Binomial Negativa    (*negative_binomial)
@end example

Por exemplo, @code{pdf_student_t(x,n)} é a fun@,{c}@~ao densidade de probabilidade da distribuição student com @var{n} graus de liberdade, @code{std_pareto(a,b)} é o desvio padrão da distribuição de Pareto com
parâmetros @var{a} e @var{b} e @code{kurtosis_poisson(m)} é o coeficiente de curtose da distribuição de Poisson com média @var{m}.


Com o objetivo de fazer uso do pacote @code{distrib} você precisa primeiro tornar esse pacote disponível para uso escrevendo
@example
(%i1) load(distrib)$
@end example

Para comentários, melhorias ou sugestões, por favor contacte o autor em @var{'mario AT edu DOT xunta DOT es'}.






@node Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes cont@'inuas, Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes discretas, Introdu@value{cedilha}@~ao a distrib, distrib
@section Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes cont@'inuas


@deffn {Fun@value{cedilha}@~ao} pdf_normal (@var{x},@var{m},@var{s})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_normal (@var{x},@var{m},@var{s})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}. Essa fun@,{c}@~ao é definida em termos de funções de erro internas do Maxima,
@code{erf}.

@c ===beg===
@c load (distrib)$
@c assume(s>0)$ cdf_normal(x,m,s);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) assume(s>0)$ cdf_normal(x,m,s);
                             x - m
                       erf(---------)
                           sqrt(2) s    1
(%o3)                  -------------- + -
                             2          2
@end example

Veja também @code{erf}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_normal (@var{q},@var{m},@var{s})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}; em outras palavras, isso é o inverso de @code{cdf_normal}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_normal (@var{m},@var{s})
Retorna a média de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}, a saber @var{m}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_normal (@var{m},@var{s})
Retorna a variância de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}, a saber @var{s^2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_normal (@var{m},@var{s})
Retorna o desvio padrão de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}, a saber @var{s}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_normal (@var{m},@var{s})
Retorna o coeficiente de assimetria de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}, que é sempre igual  a 0. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_normal (@var{m},@var{s})
Retorna o coeficiente de curtose de uma  vari@'avel aleat@'oria @math{Normal(m,s)}, com @math{s>0}, que é sempre igual  a 0. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_normal_algorithm
Valor padrão: @code{box_mueller}

Esse é o algorítmo selecionado para simular variáveis aleatórias normais. O algorítmos implementados são @code{box_mueller} e @code{inverse}:
@itemize @bullet
@item
@code{box_mueller}, Baseado no algorítmo descrito em Knuth, D.E. (1981) @var{Seminumerical Algorithms. The Art of Computer Programming.} Addison-Wesley.

@item
@code{inverse}, baseado no método inverso genérico.
@end itemize

Veja também @code{random_normal}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_normal (@var{m},@var{s})
@deffnx {Fun@value{cedilha}@~ao} random_normal (@var{m},@var{s},@var{n})
Retorna uma variável aleatória @math{Normal(m,s)}, com @math{s>0}. Chamando @code{random_normal} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Existem dois algorítmos implementados para essa fun@,{c}@~ao, e o algorítmo a ser usado pode ser selecionado fornecendo um certo valor para a variável global @code{random_normal_algorithm}, cujo valor padrão é @code{box_mueller}.

Existe também uma função interna do Maxima para simulação de variáveis normais aleatórias baseada no então chamado método de Marsaglia Ziggurat.

Veja também @code{random_normal_algorithm} e @code{gauss}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_student_t (@var{x},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_student_t (@var{x},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>0}. Essa fun@,{c}@~ao não tem uma forma definitiva e é calculada numericamente se a
variável global
@code{numer} for igual a @code{true},  de outra froma @code{cdf_student_t} retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_student_t(1/2, 7/3);
@c %,numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_student_t(1/2, 7/3);
                                     1  7
(%o2)                  cdf_student_t(-, -)
                                     2  3
(%i3) %,numer;
(%o3)                   .6698450596140417
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_student_t (@var{q},@var{n})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>0}; em outras palavras, @code{quantile_student_t} é o inverso de @code{cdf_student_t}. O argumento @var{q} deve ser um elemento de
@math{[0,1]}. Para fazer uso dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_student_t (@var{n})
Retorna a média de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>0}, que é sempre igual a 0. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_student_t (@var{n})
Retorna a variância de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>2}.

@c ===beg===
@c load (distrib)$
@c assume(n>2)$  var_student_t(n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) assume(n>2)$  var_student_t(n);
                                n
(%o3)                         -----
                              n - 2
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_student_t (@var{n})
Retorna o desvio padrão de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_student_t (@var{n})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>3}, que é sempre igual a 0. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_student_t (@var{n})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>4}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_student_t_algorithm
Valor padrão: @code{ratio}

Esse é o  algorítmo selecionado para simular variáveis aleatórias de Student. Algorítmos implementados são @code{inverse} e @code{ratio}:
@itemize @bullet
@item
@code{inverse}, baseado no método inverso geral.


@item
@code{ratio}, baseado no fato que se @var{Z} for uma vari@'avel aleat@'oria normal @math{N(0,1)} e @math{S^2} for uma vari@'avel aleat@'oria chi quadrada com @var{n} graus de liberdade, @math{Chi^2(n)}, então
@ifhtml
@example
                           Z
                 X = -------------
                     /   2  \ 1/2
                     |  S   |
                     | ---  |
                     \  n   /
@end example
@end ifhtml
@ifinfo
@example
                           Z
                 X = -------------
                     /   2  \ 1/2
                     |  S   |
                     | ---  |
                     \  n   /
@end example
@end ifinfo
@tex
$$X={{Z}\over{\sqrt{{S^2}\over{n}}}}$$
@end tex
é uma vari@'avel aleat@'oria de Student com @var{n} graus de liberdade, @math{t(n)}.
@end itemize

Veja também @code{random_student_t}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_student_t (@var{n})
@deffnx {Fun@value{cedilha}@~ao} random_student_t (@var{n},@var{m})
Retorna uma vari@'avel aleat@'oria de Student @math{t(n)}, com @math{n>0}. Chamando @code{random_student_t} com um segundo argumento @var{m}, uma amostra aleatória de tamanho @var{m} irá ser simulada.

Existem dois algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_student_t_algorithm}, cujo valor padrão é @code{ratio}.

Veja também @code{random_student_t_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_chi2 (@var{x},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

A  vari@'avel aleat@'oria @math{Chi^2(n)} é equivalente a @math{Gamma(n/2,2)}, portanto quando Maxima não tiver informação para pegar o resultado, uma forma nomial baseada na função de densidade gama é retornada.

@c ===beg===
@c load (distrib)$
@c pdf_chi2(x,n);
@c assume(x>0, n>0)$  pdf_chi2(x,n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) pdf_chi2(x,n);
                                    n
(%o2)                  pdf_gamma(x, -, 2)
                                    2
(%i3) assume(x>0, n>0)$  pdf_chi2(x,n);
                         n/2 - 1   - x/2
                        x        %e
(%o4)                   ----------------
                          n/2       n
                         2    gamma(-)
                                    2
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_chi2 (@var{x},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

Essa fun@,{c}@~ao não possui uma forma fechada e é calculada numericamante se a variável global @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal baseada na distribuição gama, uma vez
que a vari@'avel aleat@'oria @math{Chi^2(n)}
é equivalente a    é equivalente a @math{Gamma(n/2,2)}.

@c ===beg===
@c load (distrib)$
@c cdf_chi2(3,4);
@c cdf_chi2(3,4),numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_chi2(3,4);
(%o2)                  cdf_gamma(3, 2, 2)
(%i3) cdf_chi2(3,4),numer;
(%o3)                   .4421745996289249
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_chi2 (@var{q},@var{n})
Retorna o @var{q}-quantilede uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}; em outras palavras, essa função é a inversa da função @code{cdf_chi2}. O argumento @var{q} deve ser um elemento de
@math{[0,1]}.

This fun@,{c}@~ao não possui uma forma fechada e é calculada numericamante se a variável global @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal baseada na gamma quantile fun@
{c}@~ao, since the
@math{Chi^2(n)}
vari@'avel aleat@'oria é equivalente a @math{Gamma(n/2,2)}.

@c ===beg===
@c load (distrib)$
@c quantile_chi2(0.99,9);
@c quantile_chi2(0.99,n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) quantile_chi2(0.99,9);
(%o2)                   21.66599433346194
(%i3) quantile_chi2(0.99,n);
                                        n
(%o3)              quantile_gamma(0.99, -, 2)
                                        2
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_chi2 (@var{n})
Retorna a média de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

A vari@'avel aleat@'oria @math{Chi^2(n)} é equivalente a @math{Gamma(n/2,2)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na média da função gama é retornada.

@c ===beg===
@c load (distrib)$
@c mean_chi2(n);
@c assume(n>0)$ mean_chi2(n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) mean_chi2(n);
                                   n
(%o2)                   mean_gamma(-, 2)
                                   2
(%i3) assume(n>0)$ mean_chi2(n);
(%o4)                           n
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_chi2 (@var{n})
Retorna a variância de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

A vari@'avel aleat@'oria @math{Chi^2(n)} é equivalente a @math{Gamma(n/2,2)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na variância da função gama é retornada.

@c ===beg===
@c load (distrib)$
@c var_chi2(n);
@c assume(n>0)$ var_chi2(n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) var_chi2(n);
                                   n
(%o2)                    var_gamma(-, 2)
                                   2
(%i3) assume(n>0)$ var_chi2(n);
(%o4)                          2 n
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_chi2 (@var{n})
Retorna o desvio padrão de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

A vari@'avel aleat@'oria @math{Chi^2(n)} é equivalente a @math{Gamma(n/2,2)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no desvio padrão da função gama é retornada.

@c ===beg===
@c load (distrib)$
@c std_chi2(n);
@c assume(n>0)$ std_chi2(n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) std_chi2(n);
                                   n
(%o2)                    std_gamma(-, 2)
                                   2
(%i3) assume(n>0)$ std_chi2(n);
(%o4)                    sqrt(2) sqrt(n)
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_chi2 (@var{n})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

A vari@'avel aleat@'oria @math{Chi^2(n)} é equivalente a @math{Gamma(n/2,2)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no coeficiente de assimetria da função gama é
retornada.

@c ===beg===
@c load (distrib)$
@c skewness_chi2(n);
@c assume(n>0)$ skewness_chi2(n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) skewness_chi2(n);
                                     n
(%o2)                 skewness_gamma(-, 2)
                                     2
(%i3) assume(n>0)$ skewness_chi2(n);
                            2 sqrt(2)
(%o4)                       ---------
                             sqrt(n)
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_chi2 (@var{n})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria Chi-quadrada @math{Chi^2(n)}, com @math{n>0}.

A vari@'avel aleat@'oria @math{Chi^2(n)} é equivalente a @math{Gamma(n/2,2)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no coeficiente de curtose da função gama é
retornada.

@c ===beg===
@c load (distrib)$
@c kurtosis_chi2(n);
@c assume(n>0)$ kurtosis_chi2(n);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) kurtosis_chi2(n);
                                     n
(%o2)                 kurtosis_gamma(-, 2)
                                     2
(%i3) assume(n>0)$ kurtosis_chi2(n);
                               12
(%o4)                          --
                               n
@end example
@end deffn


@defvr {Variável de opção} random_chi2_algorithm
Valor padrão: @code{ahrens_cheng}

Esse é o algorítmo selecionado para simular variáveis aleatórias Chi-quadradas. Os algorítmos implementados são @code{ahrens_cheng} e @code{inverse}:
@itemize @bullet

@item
@code{ahrens_cheng}, baseado na simulação aleatória de variáveis gama. Veja @code{random_gamma_algorithm} para mias detalhes.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_chi2}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_chi2 (@var{n})
@deffnx {Fun@value{cedilha}@~ao} random_chi2 (@var{n},@var{m})
Retorna uma variável aleatória Chi-square @math{Chi^2(n)}, com @math{n>0}. Chamando @code{random_chi2} com um segundo argumento @var{m}, uma amostra aleatória de tamanho @var{m} será simulada.

Existem dois algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_chi2_algorithm}, cujo valor padrão é @code{ahrens_cheng}.

Veja também @code{random_chi2_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_f (@var{x},@var{m},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m,n>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_f (@var{x},@var{m},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m,n>0}. Essa fun@,{c}@~ao não possui uma forma definitiva e é calculada numericamente se a
variável global
@code{numer} for igual a @code{true},  de outra forma retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_f(2,3,9/4);
@c %,numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_f(2,3,9/4);
                                     9
(%o2)                    cdf_f(2, 3, -)
                                     4
(%i3) %,numer;
(%o3)                   0.66756728179008
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_f (@var{q},@var{m},@var{n})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m,n>0}; em outras palavras, essa função é o inverso de @code{cdf_f}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.

Essa fun@,{c}@~ao não possui uma forma fechada e é calculada numericamante se a variável global @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c quantile_f(2/5,sqrt(3),5);
@c %,numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) quantile_f(2/5,sqrt(3),5);
                               2
(%o2)               quantile_f(-, sqrt(3), 5)
                               5
(%i3) %,numer;
(%o3)                   0.518947838573693
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_f (@var{m},@var{n})
Retorna a média de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m>0, n>2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_f (@var{m},@var{n})
Retorna a variância de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m>0, n>4}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_f (@var{m},@var{n})
Retorna o desvio padrão de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m>0, n>4}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_f (@var{m},@var{n})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m>0, n>6}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_f (@var{m},@var{n})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria F, @math{F(m,n)}, com @math{m>0, n>8}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_f_algorithm
Valor padrão: @code{inverse}

Esse é o algorítmo selecionado para simular variáveis aleatórias F. Os algorítmos implementados são @code{ratio} e @code{inverse}:
@itemize @bullet

@item
@code{ratio}, baseado no fato de que se @var{X} for uma vari@'avel aleat@'oria @math{Chi^2(m)} e @math{Y} for uma vari@'avel aleat@'oria @math{Chi^2(n)}, então
@ifhtml
@example
                        n X
                    F = ---
                        m Y
@end example
@end ifhtml
@ifinfo
@example
                        n X
                    F = ---
                        m Y
@end example
@end ifinfo
@tex
$$F={{n X}\over{m Y}}$$
@end tex
é uma vari@'avel aleat@'oria F com @var{m} e @var{n} graus de liberdade, @math{F(m,n)}.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_f}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_f (@var{m},@var{n})
@deffnx {Fun@value{cedilha}@~ao} random_f (@var{m},@var{n},@var{k})
Retorna uma variável aleatória F, @math{F(m,n)}, com @math{m,n>0}. Chamando @code{random_f} com um terceiro argumento @var{k}, uma amostra aleatória de tamanho @var{k} irá ser simulada.

Existem dois algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_f_algorithm}, cujo valor padrão é @code{inverse}.

Veja também @code{random_f_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_exp (@var{x},@var{m})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na função de densidade de Weibull
éretornada.

@c ===beg===
@c load (distrib)$
@c pdf_exp(x,m);
@c assume(x>0,m>0)$  pdf_exp(x,m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) pdf_exp(x,m);
                                        1
(%o2)                 pdf_weibull(x, 1, -)
                                        m
(%i3) assume(x>0,m>0)$  pdf_exp(x,m);
                                - m x
(%o4)                       m %e
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_exp (@var{x},@var{m})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na distribuição de Weibull é
retornadaretornada.

@c ===beg===
@c load (distrib)$
@c cdf_exp(x,m);
@c assume(x>0,m>0)$  cdf_exp(x,m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_exp(x,m);
                                        1
(%o2)                 cdf_weibull(x, 1, -)
                                        m
(%i3) assume(x>0,m>0)$  cdf_exp(x,m);
                                 - m x
(%o4)                      1 - %e
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_exp (@var{q},@var{m})
Retorna o @var{q}-quantil vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}; em outras palavras, essa função é inversa da função @code{cdf_exp}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no qualtil de Weibull é retornada.

@c ===beg===
@c load (distrib)$
@c quantile_exp(0.56,5);
@c quantile_exp(0.56,m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) quantile_exp(0.56,5);
(%o2)                   .1641961104139661
(%i3) quantile_exp(0.56,m);
                                            1
(%o3)             quantile_weibull(0.56, 1, -)
                                            m
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_exp (@var{m})
Retorna a média de uma vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na média de Weibull é reornada.

@c ===beg===
@c load (distrib)$
@c mean_exp(m);
@c assume(m>0)$  mean_exp(m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) mean_exp(m);
                                       1
(%o2)                  mean_weibull(1, -)
                                       m
(%i3) assume(m>0)$  mean_exp(m);
                                1
(%o4)                           -
                                m
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_exp (@var{m})
Retorna a variância de uma vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na variância de Weibull é retornada.

@c ===beg===
@c load (distrib)$
@c var_exp(m);
@c assume(m>0)$  var_exp(m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) var_exp(m);
                                       1
(%o2)                   var_weibull(1, -)
                                       m
(%i3) assume(m>0)$  var_exp(m);
                               1
(%o4)                          --
                                2
                               m
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_exp (@var{m})
Retorna o desvio padrão de uma vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no desvio padrão de Weibull é retornada.

@c ===beg===
@c load (distrib)$
@c std_exp(m);
@c assume(m>0)$  std_exp(m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) std_exp(m);
                                       1
(%o2)                   std_weibull(1, -)
                                       m
(%i3) assume(m>0)$  std_exp(m);
                                1
(%o4)                           -
                                m
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_exp (@var{m})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no coeficiente de assimetria de Weibull
é retornada.

@c ===beg===
@c load (distrib)$
@c skewness_exp(m);
@c assume(m>0)$  skewness_exp(m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) skewness_exp(m);
                                         1
(%o2)                skewness_weibull(1, -)
                                         m
(%i3) assume(m>0)$  skewness_exp(m);
(%o4)                           2
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_exp (@var{m})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria @math{Exponential(m)}, com @math{m>0}.

A vari@'avel aleat@'oria @math{Exponential(m)} é equivalente a @math{Weibull(1,1/m)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada no coeficiente de curtose de Weibull é
retornada.

@c ===beg===
@c load (distrib)$
@c kurtosis_exp(m);
@c assume(m>0)$  kurtosis_exp(m);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) kurtosis_exp(m);
                                         1
(%o2)                kurtosis_weibull(1, -)
                                         m
(%i3) assume(m>0)$  kurtosis_exp(m);
(%o4)                           6
@end example
@end deffn


@defvr {Variável de opção} random_exp_algorithm
Valor padrão: @code{inverse}

Esse é o algorítmo selecionado para simular variáveis exponenciais aleatórias. Os algorítmos implementados são @code{inverse}, @code{ahrens_cheng} e @code{ahrens_dieter}
@itemize @bullet

@item
@code{inverse}, baseado no método inverso geral.

@item
@code{ahrens_cheng}, baseado no fato de que a vari@'avel aleat@'oria @math{Exp(m)} é equivalente a @math{Gamma(1,1/m)}. Veja @code{random_gamma_algorithm} para maiores detalhes.

@item
@code{ahrens_dieter}, baseado no algorítmo descrito em Ahrens, J.H. e Dieter, U. (1972) @var{Computer methods for sampling from the exponential and normal distributions.} Comm, ACM, 15, Oct.,  873-882.

@end itemize

Veja também @code{random_exp}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_exp (@var{m})
@deffnx {Fun@value{cedilha}@~ao} random_exp (@var{m},@var{k})
Retorna uma variável aleatória @math{Exponential(m)}, com @math{m>0}. Chamando @code{random_exp} com um segundo argumento @var{k}, uma amostra aleatória de tamanho @var{k} irá ser simulada.

Existem três algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_exp_algorithm}, cujo valor padrão é @code{inverse}.

Veja também @code{random_exp_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_lognormal (@var{x},@var{m},@var{s})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_lognormal (@var{x},@var{m},@var{s})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Essa fun@,{c}@~ao é definida em termos de funções de erro internas do Maxima
fun@,{c}@~ao @code{erf}.

@c ===beg===
@c load (distrib)$
@c assume(x>0, s>0)$  cdf_lognormal(x,m,s);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) assume(x>0, s>0)$  cdf_lognormal(x,m,s);
                           log(x) - m
                       erf(----------)
                           sqrt(2) s     1
(%o3)                  --------------- + -
                              2          2
@end example

Veja também @code{erf}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_lognormal (@var{q},@var{m},@var{s})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}; em outras palavras, essa função é a inversa da função @code{cdf_lognormal}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.
Para fazer uso
dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_lognormal (@var{m},@var{s})
Retorna a média de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_lognormal (@var{m},@var{s})
Retorna a variância de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_lognormal (@var{m},@var{s})
Retorna o desvio padrão de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_lognormal (@var{m},@var{s})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_lognormal (@var{m},@var{s})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria @math{Lognormal(m,s)}, com @math{s>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_lognormal (@var{m},@var{s})
@deffnx {Fun@value{cedilha}@~ao} random_lognormal (@var{m},@var{s},@var{n})
Retorna uma variável aleatória @math{Lognormal(m,s)}, com @math{s>0}. Chamando @code{random_lognormal} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Variáveis Log-normal são simuladas por meio de variáveis normais aleatórias. Existem dois algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global
@code{random_normal_algorithm}, cujo valor padrão é @code{box_mueller}.

Veja também @code{random_normal_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_gamma (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_gamma (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. 

Essa fun@,{c}@~ao não possui uma forma fechada e é calculada numericamante se a variável global @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_gamma(3,5,21);
@c %,numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_gamma(3,5,21);
(%o2)                  cdf_gamma(3, 5, 21)
(%i3) %,numer;
(%o3)                 4.402663157135039E-7
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_gamma (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}; em outras palavras, essa função é a inversa da função @code{cdf_gamma}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_gamma (@var{a},@var{b})
Retorna a média de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_gamma (@var{a},@var{b})
Retorna a variância de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_gamma (@var{a},@var{b})
Retorna o desvio padrão de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_gamma (@var{a},@var{b})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_gamma (@var{a},@var{b})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria @math{Gamma(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_gamma_algorithm
Valor padrão: @code{ahrens_cheng}

Esse é o algorítmo selecionado para simular variáveis gama aleatórias. Os algorítmos implementados são @code{ahrens_cheng} e @code{inverse}
@itemize @bullet

@item
@code{ahrens_cheng}, essa é uma combinação de dois processos, dependendo do valor do parâmetro @var{a}:

For @math{a>=1}, Cheng, R.C.H. e Feast, G.M. (1979). @var{Some simple gamma variate generators}. Appl. Stat., 28, 3, 290-295.

For @math{0<a<1}, Ahrens, J.H. e Dieter, U. (1974). @var{Computer methods for sampling from gamma, beta, poisson and binomial cdf_tributions}. Computing, 12, 223-246.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_gamma}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_gamma (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_gamma (@var{a},@var{b},@var{n})
Retorna uma variável aleatória @math{Gamma(a,b)}, com @math{a,b>0}. Chamando @code{random_gamma} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Existem dois algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_gamma_algorithm}, cujo valor padrão é @code{ahrens_cheng}.

Veja também @code{random_gamma_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_beta (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} cdf_beta (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. 

Essa fun@,{c}@~ao não possui uma forma fechada e é calculada numericamante se a variável global @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_beta(1/3,15,2);
@c %,numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_beta(1/3,15,2);
                                 1
(%o2)                   cdf_beta(-, 15, 2)
                                 3
(%i3) %,numer;
(%o3)                 7.666089131388224E-7
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_beta (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}; em outras palavras, essa função é a inversa da função @code{cdf_beta}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_beta (@var{a},@var{b})
Retorna a média de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_beta (@var{a},@var{b})
Retorna a variância de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_beta (@var{a},@var{b})
Retorna o desvio padrão de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_beta (@var{a},@var{b})
Retorna o coeficiente de assimetria de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_beta (@var{a},@var{b})
Retorna o coeficiente de curtose de uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_beta_algorithm
Valor padrão: @code{cheng}

Esse é o algorítmo selecionado para simular variáveis beta aleatórias. Os algorítmos implementados são @code{cheng}, @code{inverse} e @code{ratio}
@itemize @bullet

@item
@code{cheng}, esse é o algorítmo definido em Cheng, R.C.H.  (1978). @var{Generating Beta Variates with Nonintegral Shape Parameters}. Communications of the ACM, 21:317-322

@item
@code{inverse}, baseado no método inverso geral.

@item
@code{ratio}, baseado no fato de que se @var{X} for uma vari@'avel aleat@'oria @math{Gamma(a,1)} e @var{Y} for @math{Gamma(b,1)}, então a razão @math{X/(X+Y)} está distribuída como @math{Beta(a,b)}.

@end itemize

Veja também @code{random_beta}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_beta (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_beta (@var{a},@var{b},@var{n})
Retorna uma vari@'avel aleat@'oria @math{Beta(a,b)}, com @math{a,b>0}. Chamando @code{random_beta} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Existem três algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_beta_algorithm}, cujo valor padrão é @code{cheng}.

Veja também @code{random_beta_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} pdf_continuous_uniform (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade de uma vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_continuous_uniform (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade de uma vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_continuous_uniform (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantil de uma vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}; em outras palavras, essa função é a inversa da função @code{cdf_continuous_uniform}. O argumento @var{q} deve ser um elemento
de @math{[0,1]}.
Para
fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_continuous_uniform (@var{a},@var{b})
Retorna a média de uma vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_continuous_uniform (@var{a},@var{b})
Retorna o variance of a vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_continuous_uniform (@var{a},@var{b})
Retorna o desvio padrão of a vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_continuous_uniform (@var{a},@var{b})
Retorna o coeficiente de assimetria of a vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_continuous_uniform (@var{a},@var{b})
Retorna o coeficiente de curtose of a vari@'avel aleat@'oria @math{Continuous Uniform(a,b)}, com @math{a<b}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_continuous_uniform (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_continuous_uniform (@var{a},@var{b},@var{n})
Retorna um @math{Continuous Uniform(a,b)} random variate, com @math{a<b}. Chamando @code{random_continuous_uniform} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

This is a direct application of the @code{random} built-in fun@,{c}@~ao do Maxima.

Veja também @code{random}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_logistic (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_logistic (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_logistic (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantile of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}; em outras palavras, essa função é a inversa da função @code{cdf_logistic}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.
Para fazer uso
dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} meanlog (@var{a},@var{b})
Retorna a média de uma @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_logistic (@var{a},@var{b})
Retorna o variance of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_logistic (@var{a},@var{b})
Retorna o desvio padrão of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_logistic (@var{a},@var{b})
Retorna o coeficiente de assimetria of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_logistic (@var{a},@var{b})
Retorna o coeficiente de curtose of a @math{Logistic(a,b)} vari@'avel aleat@'oria , com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_logistic (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_logistic (@var{a},@var{b},@var{n})
Retorna um @math{Logistic(a,b)} random variate, com @math{b>0}. Chamando @code{random_logistic} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_pareto (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_pareto (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_pareto (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantile of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}; em outras palavras, essa função é a inversa da função @code{cdf_pareto}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_pareto (@var{a},@var{b})
Retorna a média de uma @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a>1,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_pareto (@var{a},@var{b})
Retorna o variance of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a>2,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_pareto (@var{a},@var{b})
Retorna o desvio padrão of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a>2,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} skewness_pareto (@var{a},@var{b})
Retorna o coeficiente de assimetria of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a>3,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_pareto (@var{a},@var{b})
Retorna o coeficiente de curtose of a @math{Pareto(a,b)} vari@'avel aleat@'oria, com @math{a>4,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_pareto (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_pareto (@var{a},@var{b},@var{n})
Retorna um @math{Pareto(a,b)} random variate, com @math{a>0,b>0}. Chamando @code{random_pareto} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_weibull (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_weibull (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_weibull (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantile of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}; em outras palavras, essa função é a inversa da função @code{cdf_weibull}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.
Para fazer uso dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_weibull (@var{a},@var{b})
Retorna a média de uma @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_weibull (@var{a},@var{b})
Retorna o variance of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn

@deffn {Fun@value{cedilha}@~ao} std_weibull (@var{a},@var{b})
Retorna o desvio padrão of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} skewness_weibull (@var{a},@var{b})
Retorna o coeficiente de assimetria of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_weibull (@var{a},@var{b})
Retorna o coeficiente de curtose of a @math{Weibull(a,b)} vari@'avel aleat@'oria, com @math{a,b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_weibull (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_weibull (@var{a},@var{b},@var{n})
Retorna um @math{Weibull(a,b)} random variate, com @math{a,b>0}. Chamando @code{random_weibull} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} pdf_rayleigh (@var{x},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull density é retornada.

@c ===beg===
@c load (distrib)$
@c pdf_rayleigh(x,b);
@c assume(x>0,b>0)$ pdf_rayleigh(x,b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) pdf_rayleigh(x,b);
                                        1
(%o2)                 pdf_weibull(x, 2, -)
                                        b
(%i3) assume(x>0,b>0)$ pdf_rayleigh(x,b);
                                    2  2
                           2     - b  x
(%o4)                   2 b  x %e
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_rayleigh (@var{x},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull distribution é retornada.

@c ===beg===
@c load (distrib)$
@c cdf_rayleigh(x,b);
@c assume(x>0,b>0)$ cdf_rayleigh(x,b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_rayleigh(x,b);
                                        1
(%o2)                 cdf_weibull(x, 2, -)
                                        b
(%i3) assume(x>0,b>0)$ cdf_rayleigh(x,b);
                                   2  2
                                - b  x
(%o4)                     1 - %e
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_rayleigh (@var{q},@var{b})
Retorna o @var{q}-quantile of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}; em outras palavras, essa função é a inversa da função @code{cdf_rayleigh}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull quantile é retornada.

@c ===beg===
@c load (distrib)$
@c quantile_rayleigh(0.99,b);
@c assume(x>0,b>0)$ quantile_rayleigh(0.99,b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) quantile_rayleigh(0.99,b);
                                            1
(%o2)             quantile_weibull(0.99, 2, -)
                                            b
(%i3) assume(x>0,b>0)$ quantile_rayleigh(0.99,b);
                        2.145966026289347
(%o4)                   -----------------
                                b
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_rayleigh (@var{b})
Retorna a média de uma @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull mean é retornada.

@c ===beg===
@c load (distrib)$
@c mean_rayleigh(b);
@c assume(b>0)$ mean_rayleigh(b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) mean_rayleigh(b);
                                       1
(%o2)                  mean_weibull(2, -)
                                       b
(%i3) assume(b>0)$ mean_rayleigh(b);
                            sqrt(%pi)
(%o4)                       ---------
                               2 b
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_rayleigh (@var{b})
Retorna o variance of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull variance é retornada.

@c ===beg===
@c load (distrib)$
@c var_rayleigh(b);
@c assume(b>0)$ var_rayleigh(b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) var_rayleigh(b);
                                       1
(%o2)                   var_weibull(2, -)
                                       b
(%i3) assume(b>0)$ var_rayleigh(b);
                                 %pi
                             1 - ---
                                  4
(%o4)                        -------
                                2
                               b
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_rayleigh (@var{b})
Retorna o desvio padrão of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull desvio padrão é retornada.

@c ===beg===
@c load (distrib)$
@c std_rayleigh(b);
@c assume(b>0)$ std_rayleigh(b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) std_rayleigh(b);
                                       1
(%o2)                   std_weibull(2, -)
                                       b
(%i3) assume(b>0)$ std_rayleigh(b);
                                   %pi
                          sqrt(1 - ---)
                                    4
(%o4)                     -------------
                                b
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_rayleigh (@var{b})
Retorna o coeficiente de assimetria of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull coeficiente de assimetria é
retornada.

@c ===beg===
@c load (distrib)$
@c skewness_rayleigh(b);
@c assume(b>0)$ skewness_rayleigh(b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) skewness_rayleigh(b);
                                         1
(%o2)                skewness_weibull(2, -)
                                         b
(%i3) assume(b>0)$ skewness_rayleigh(b);
                         3/2
                      %pi      3 sqrt(%pi)
                      ------ - -----------
                        4           4
(%o4)                 --------------------
                               %pi 3/2
                          (1 - ---)
                                4
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_rayleigh (@var{b})
Retorna o coeficiente de curtose of a @math{Rayleigh(b)} vari@'avel aleat@'oria, com @math{b>0}.

The @math{Rayleigh(b)} vari@'avel aleat@'oria é equivalente a @math{Weibull(2,1/b)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na Weibull coeficiente de curtose é
retornada.

@c ===beg===
@c load (distrib)$
@c kurtosis_rayleigh(b);
@c assume(b>0)$ kurtosis_rayleigh(b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) kurtosis_rayleigh(b);
                                         1
(%o2)                kurtosis_weibull(2, -)
                                         b
(%i3) assume(b>0)$ kurtosis_rayleigh(b);
                                  2
                             3 %pi
                         2 - ------
                               16
(%o4)                    ---------- - 3
                              %pi 2
                         (1 - ---)
                               4
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_rayleigh (@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_rayleigh (@var{b},@var{n})
Retorna um @math{Rayleigh(b)} random variate, com @math{b>0}. Chamando @code{random_rayleigh} com um segundo argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} pdf_laplace (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_laplace (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_laplace (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantile of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}; em outras palavras, essa função é a inversa da função @code{cdf_laplace}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_laplace (@var{a},@var{b})
Retorna a média de uma @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_laplace (@var{a},@var{b})
Retorna o variance of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_laplace (@var{a},@var{b})
Retorna o desvio padrão of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_laplace (@var{a},@var{b})
Retorna o coeficiente de assimetria of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_laplace (@var{a},@var{b})
Retorna o coeficiente de curtose of a @math{Laplace(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_laplace (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_laplace (@var{a},@var{b},@var{n})
Retorna um @math{Laplace(a,b)} random variate, com @math{b>0}. Chamando @code{random_laplace} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} pdf_cauchy (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Cauchy(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_cauchy (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Cauchy(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_cauchy (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantile of a @math{Cauchy(a,b)} vari@'avel aleat@'oria, com @math{b>0}; em outras palavras, essa função é a inversa da função @code{cdf_cauchy}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_cauchy (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_cauchy (@var{a},@var{b},@var{n})
Retorna um @math{Cauchy(a,b)} random variate, com @math{b>0}. Chamando @code{random_cauchy} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn



@deffn {Fun@value{cedilha}@~ao} pdf_gumbel (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao densidade de probabilidade of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_gumbel (@var{x},@var{a},@var{b})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_gumbel (@var{q},@var{a},@var{b})
Retorna o @var{q}-quantile of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}; em outras palavras, essa função é a inversa da função @code{cdf_gumbel}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_gumbel (@var{a},@var{b})
Retorna a média de uma @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}.

@c ===beg===
@c load (distrib)$
@c assume(b>0)$  mean_gumbel(a,b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) assume(b>0)$  mean_gumbel(a,b);
(%o3)                     %gamma b + a
@end example
where symbol @code{%gamma} stands for the Euler-Mascheroni constant. Veja também @code{%gamma}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_gumbel (@var{a},@var{b})
Retorna o variance of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_gumbel (@var{a},@var{b})
Retorna o desvio padrão of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_gumbel (@var{a},@var{b})
Retorna o coeficiente de assimetria of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}.

@c ===beg===
@c load (distrib)$
@c assume(b>0)$ skewness_gumbel(a,b);
@c numer:true$ skewness_gumbel(a,b);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) assume(b>0)$ skewness_gumbel(a,b);
                       12 sqrt(6) zeta(3)
(%o3)                  ------------------
                                 3
                              %pi
(%i4) numer:true$ skewness_gumbel(a,b);
(%o5)                   1.139547099404649
@end example
where @code{zeta} stands for the Riemann's zeta fun@,{c}@~ao.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_gumbel (@var{a},@var{b})
Retorna o coeficiente de curtose of a @math{Gumbel(a,b)} vari@'avel aleat@'oria, com @math{b>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_gumbel (@var{a},@var{b})
@deffnx {Fun@value{cedilha}@~ao} random_gumbel (@var{a},@var{b},@var{n})
Retorna um @math{Gumbel(a,b)} random variate, com @math{b>0}. Chamando @code{random_gumbel} com um terceiro argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Only the inverse method is implemented. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@node Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes discretas,  , Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes cont@'inuas, distrib
@section Defini@value{cedilha}@~oes para distribui@value{cedilha}@~oes discretas


@deffn {Fun@value{cedilha}@~ao} pdf_binomial (@var{x},@var{n},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_binomial (@var{x},@var{n},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer.

Essa fun@,{c}@~ao is numerically computed if the global variable @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_binomial(5,7,1/6);
@c cdf_binomial(5,7,1/6), numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_binomial(5,7,1/6);
                                         1
(%o2)                 cdf_binomial(5, 7, -)
                                         6
(%i3) cdf_binomial(5,7,1/6), numer;
(%o3)                   .9998713991769548
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_binomial (@var{q},@var{n},@var{p})
Retorna o @var{q}-quantile of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer; em outras palavras, essa função é a inversa da função @code{cdf_binomial}. O argumento @var{q} deve
ser um elemento de
@math{[0,1]}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_binomial (@var{n},@var{p})
Retorna a média de uma @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_binomial (@var{n},@var{p})
Retorna o variance of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_binomial (@var{n},@var{p})
Retorna o desvio padrão of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_binomial (@var{n},@var{p})
Retorna o coeficiente de assimetria of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_binomial (@var{n},@var{p})
Retorna o coeficiente de curtose of a @math{Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_binomial_algorithm
Valor padrão: @code{kachit}

Esse é o algorítmo selecionado para simular random binomial variates. Algorítmos implementados são @code{kachit}, @code{bernoulli} and @code{inverse}:
@itemize @bullet

@item
@code{kachit}, baseado no algorítmo descrito em Kachitvichyanukul, V. and Schmeiser, B.W. (1988) @var{Binomial Random Variate Generation}. Communications of the ACM, 31, Feb., 216.

@item
@code{bernoulli}, based on simulation of Bernoulli trials.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_binomial}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_binomial (@var{n},@var{p})
@deffnx {Fun@value{cedilha}@~ao} random_binomial (@var{n},@var{p},@var{m})
Retorna um @math{Binomial(n,p)} random variate, com @math{0<p<1} and @math{n} a positive integer. Chamando @code{random_binomial} com um terceiro argumento @var{m}, uma amostra aleatória de tamanho @var{m} irá ser simulada.

Existem três algorítmos implementado for Essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_binomial_algorithm}, cujo valor padrão é @code{kachit}.

Veja também @code{random_binomial_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_poisson (@var{x},@var{m})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Poisson(m)} vari@'avel aleat@'oria, com @math{m>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_poisson (@var{x},@var{m})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Poisson(m)} vari@'avel aleat@'oria, com @math{m>0}.

Essa fun@,{c}@~ao is numerically computed if the global variable @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_poisson(3,5);
@c cdf_poisson(3,5), numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_poisson(3,5);
(%o2)                   cdf_poisson(3, 5)
(%i3) cdf_poisson(3,5), numer;
(%o3)                   .2650259152973617
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_poisson (@var{q},@var{m})
Retorna o @var{q}-quantile of a @math{Poisson(m)} vari@'avel aleat@'oria, com @math{m>0}; em outras palavras, essa função é a inversa da função @code{cdf_poisson}. O argumento @var{q} deve ser um elemento de @math{[0,1]}. Para
fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_poisson (@var{m})
Retorna a média de uma @math{Poisson(m)} vari@'avel aleat@'oria, with  @math{m>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_poisson (@var{m})
Retorna o variance of a @math{Poisson(m)} vari@'avel aleat@'oria, with  @math{m>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_poisson (@var{m})
Retorna o desvio padrão of a @math{Poisson(m)} vari@'avel aleat@'oria, com @math{m>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_poisson (@var{m})
Retorna o coeficiente de assimetria of a @math{Poisson(m)} vari@'avel aleat@'oria, com @math{m>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_poisson (@var{m})
Retorna o coeficiente de curtose of a Poisson vari@'avel aleat@'oria  @math{Poi(m)}, com @math{m>0}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_poisson_algorithm
Valor padrão: @code{ahrens_dieter}

Esse é o algorítmo selecionado para simular random Poisson variates. Algorítmos implementados são @code{ahrens_dieter} and @code{inverse}:
@itemize @bullet

@item
@code{ahrens_dieter}, baseado no algorítmo descrito em Ahrens, J.H. and Dieter, U. (1982) @var{Computer Generation of Poisson Deviates From Modified Normal Distributions}. ACM Trans. Math. Software, 8, 2, June,163-179.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_poisson}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_poisson (@var{m})
@deffnx {Fun@value{cedilha}@~ao} random_poisson (@var{m},@var{n})
Retorna um @math{Poisson(m)} random variate, com @math{m>0}. Chamando @code{random_poisson} com um segundo argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Existem dois algorítmos implementado for Essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_poisson_algorithm}, cujo valor padrão é @code{ahrens_dieter}.

Veja também @code{random_poisson_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_bernoulli (@var{x},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}.

The @math{Bernoulli(p)} vari@'avel aleat@'oria é equivalente a @math{Binomial(1,p)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na binomial fun@,{c}@~ao de probabilidade
is
returned.

@c ===beg===
@c load (distrib)$
@c pdf_bernoulli(1,p);
@c assume(0<p,p<1)$ pdf_bernoulli(1,p);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) pdf_bernoulli(1,p);
(%o2)                 pdf_binomial(1, 1, p)
(%i3) assume(0<p,p<1)$ pdf_bernoulli(1,p);
(%o4)                           p
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_bernoulli (@var{x},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_bernoulli (@var{q},@var{p})
Retorna o @var{q}-quantile of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}; em outras palavras, essa função é a inversa da função @code{cdf_bernoulli}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.
Para fazer uso
dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_bernoulli (@var{p})
Retorna a média de uma @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}.

The @math{Bernoulli(p)} vari@'avel aleat@'oria é equivalente a @math{Binomial(1,p)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na binomial mean é retornada.

@c ===beg===
@c load (distrib)$
@c mean_bernoulli(p);
@c assume(0<p,p<1)$ mean_bernoulli(p);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) mean_bernoulli(p);
(%o2)                  mean_binomial(1, p)
(%i3) assume(0<p,p<1)$ mean_bernoulli(p);
(%o4)                           p
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_bernoulli (@var{p})
Retorna o variance of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}.

The @math{Bernoulli(p)} vari@'avel aleat@'oria é equivalente a @math{Binomial(1,p)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na binomial variance é retornada.

@c ===beg===
@c load (distrib)$
@c var_bernoulli(p);
@c assume(0<p,p<1)$ var_bernoulli(p);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) var_bernoulli(p);
(%o2)                  var_binomial(1, p)
(%i3) assume(0<p,p<1)$ var_bernoulli(p);
(%o4)                       (1 - p) p
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_bernoulli (@var{p})
Retorna o desvio padrão of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}.

The @math{Bernoulli(p)} vari@'avel aleat@'oria é equivalente a @math{Binomial(1,p)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na binomial desvio padrão é retornada.

@c ===beg===
@c load (distrib)$
@c std_bernoulli(p);
@c assume(0<p,p<1)$ std_bernoulli(p);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) std_bernoulli(p);
(%o2)                  std_binomial(1, p)
(%i3) assume(0<p,p<1)$ std_bernoulli(p);
(%o4)                  sqrt(1 - p) sqrt(p)
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_bernoulli (@var{p})
Retorna o coeficiente de assimetria of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}.

The @math{Bernoulli(p)} vari@'avel aleat@'oria é equivalente a @math{Binomial(1,p)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na binomial coeficiente de assimetria é
retornada.

@c ===beg===
@c load (distrib)$
@c skewness_bernoulli(p);
@c assume(0<p,p<1)$ skewness_bernoulli(p);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) skewness_bernoulli(p);
(%o2)                skewness_binomial(1, p)
(%i3) assume(0<p,p<1)$ skewness_bernoulli(p);
                             1 - 2 p
(%o4)                  -------------------
                       sqrt(1 - p) sqrt(p)
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_bernoulli (@var{p})
Retorna o coeficiente de curtose of a @math{Bernoulli(p)} vari@'avel aleat@'oria, com @math{0<p<1}.

The @math{Bernoulli(p)} vari@'avel aleat@'oria é equivalente a @math{Binomial(1,p)}, embora quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal baseada na binomial coeficiente de curtose é
retornada.

@c ===beg===
@c load (distrib)$
@c kurtosis_bernoulli(p);
@c assume(0<p,p<1)$ kurtosis_bernoulli(p);
@c ===end===
@example
(%i1) load (distrib)$
(%i2) kurtosis_bernoulli(p);
(%o2)                kurtosis_binomial(1, p)
(%i3) assume(0<p,p<1)$ kurtosis_bernoulli(p);
                         1 - 6 (1 - p) p
(%o4)                    ---------------
                            (1 - p) p
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_bernoulli (@var{p})
@deffnx {Fun@value{cedilha}@~ao} random_bernoulli (@var{p},@var{n})
Retorna um @math{Bernoulli(p)} random variate, com @math{0<p<1}. Chamando @code{random_bernoulli} com um segundo argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

This is a direct application of the @code{random} built-in fun@,{c}@~ao do Maxima.

Veja também @code{random}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_geometric (@var{x},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_geometric (@var{x},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_geometric (@var{q},@var{p})
Retorna o @var{q}-quantile of a @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}; em outras palavras, essa função é a inversa da função @code{cdf_geometric}. O argumento @var{q} deve ser um elemento de @math{[0,1]}.
Para fazer uso
dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_geometric (@var{p})
Retorna a média de uma @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_geometric (@var{p})
Retorna o variance of a @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_geometric (@var{p})
Retorna o desvio padrão of a @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_geometric (@var{p})
Retorna o coeficiente de assimetria of a @math{Geometric(p)} vari@'avel aleat@'oria, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_geometric (@var{p})
Retorna o coeficiente de curtose of a geometric vari@'avel aleat@'oria  @math{Geo(p)}, com @math{0<p<1}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_geometric_algorithm
Valor padrão: @code{bernoulli}

Esse é o algorítmo selecionado para simular random geometric variates. Algorítmos implementados são @code{bernoulli}, @code{devroye} and @code{inverse}:
@itemize @bullet

@item
@code{bernoulli}, based on simulation of Bernoulli trials.

@item
@code{devroye}, baseado no algorítmo descrito em Devroye, L. (1986) @var{Non-Uniform Random Variate Generation.} Springer Verlag, p. 480.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_geometric}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_geometric (@var{p})
@deffnx {Fun@value{cedilha}@~ao} random_geometric (@var{p},@var{n})
Retorna um @math{Geometric(p)} random variate, com @math{0<p<1}. Chamando @code{random_geometric} com um segundo argumento @var{n}, uma amostra aleatória de tamanho @var{n} irá ser simulada.

Existem três algorítmos implementado for Essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_geometric_algorithm}, cujo valor padrão é @code{bernoulli}.

Veja também @code{random_geometric_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_discrete_uniform (@var{x},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_discrete_uniform (@var{x},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva
primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_discrete_uniform (@var{q},@var{n})
Retorna o @var{q}-quantile of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer; em outras palavras, essa função é a inversa da função @code{cdf_discrete_uniform}. O argumento @var{q}
must be an
element
of @math{[0,1]}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_discrete_uniform (@var{n})
Retorna a média de uma @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_discrete_uniform (@var{n})
Retorna o variance of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_discrete_uniform (@var{n})
Retorna o desvio padrão of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_discrete_uniform (@var{n})
Retorna o coeficiente de assimetria of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_discrete_uniform (@var{n})
Retorna o coeficiente de curtose of a @math{Discrete Uniform(n)} vari@'avel aleat@'oria, com @math{n} a strictly positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} random_discrete_uniform (@var{n})
@deffnx {Fun@value{cedilha}@~ao} random_discrete_uniform (@var{n},@var{m})
Retorna um @math{Discrete Uniform(n)} random variate, com @math{n} a strictly positive integer. Chamando @code{random_discrete_uniform} com um segundo argumento @var{m}, uma amostra aleatória de tamanho @var{m} irá ser simulada.

This is a direct application of the @code{random} built-in fun@,{c}@~ao do Maxima.

Veja também @code{random}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_hypergeometric (@var{x},@var{n1},@var{n2},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Hypergeometric(n1,n2,n)} vari@'avel aleat@'oria, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para fazer uso dessa
fun@,{c}@~ao,
escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_hypergeometric (@var{x},@var{n1},@var{n2},@var{n})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Hypergeometric(n1,n2,n)} vari@'avel aleat@'oria, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para
fazer uso dessa
fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_hypergeometric (@var{q},@var{n1},@var{n2},@var{n})
Retorna o @var{q}-quantile of a @math{Hypergeometric(n1,n2,n)} vari@'avel aleat@'oria, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}; em outras palavras, essa função é a inversa da função
@code{cdf_hypergeometric}.
Argument @var{q} deve ser um elemento de @math{[0,1]}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_hypergeometric (@var{n1},@var{n2},@var{n})
Retorna a média de uma discreta uniform vari@'avel aleat@'oria @math{Hyp(n1,n2,n)}, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_hypergeometric (@var{n1},@var{n2},@var{n})
Retorna o variance of a hypergeometric  vari@'avel aleat@'oria @math{Hyp(n1,n2,n)}, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_hypergeometric (@var{n1},@var{n2},@var{n})
Retorna o desvio padrão of a @math{Hypergeometric(n1,n2,n)} vari@'avel aleat@'oria, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_hypergeometric (@var{n1},@var{n2},@var{n})
Retorna o coeficiente de assimetria of a @math{Hypergeometric(n1,n2,n)} vari@'avel aleat@'oria, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para fazer uso dessa fun@,{c}@~ao, escreva
primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_hypergeometric (@var{n1},@var{n2},@var{n})
Retorna o coeficiente de curtose of a @math{Hypergeometric(n1,n2,n)} vari@'avel aleat@'oria, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente
@code{load(distrib)}.
@end deffn

@defvr {Variável de opção} random_hypergeometric_algorithm
Valor padrão: @code{kachit}

Esse é o algorítmo selecionado para simular random hypergeometric variates. Algorítmos implementados são @code{kachit} and @code{inverse}:
@itemize @bullet

@item
@code{kachit}, baseado no algorítmo descrito em Kachitvichyanukul, V., Schmeiser, B.W. (1985) @var{Computer generation of hypergeometric random variates.} Journal of Statistical Computation and Simulation 22, 127-145.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_hypergeometric}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_hypergeometric (@var{n1},@var{n2},@var{n})
@deffnx {Fun@value{cedilha}@~ao} random_hypergeometric (@var{n1},@var{n2},@var{n},@var{m})
Retorna um @math{Hypergeometric(n1,n2,n)} random variate, com @var{n1}, @var{n2} and @var{n} non negative integers and @math{n<=n1+n2}. Chamando @code{random_hypergeometric} with a fourth argument @var{m}, uma amostra aleatória
de tamanho
@var{m} irá ser simulada.

Existem dois algorítmos implementado for Essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_hypergeometric_algorithm}, cujo valor padrão é @code{kachit}.

Veja também @code{random_hypergeometric_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} pdf_negative_binomial (@var{x},@var{n},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao de probabilidade of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva
primeiramente
@code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} cdf_negative_binomial (@var{x},@var{n},@var{p})
Retorna o valor em @var{x} da fun@,{c}@~ao distribui@,{c}@~ao de probabilidade of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer.

Essa fun@,{c}@~ao is numerically computed if the global variable @code{numer} for igual a @code{true},  de outra forma essa função retorna uma expressão nominal.

@c ===beg===
@c load (distrib)$
@c cdf_negative_binomial(3,4,1/8);
@c cdf_negative_binomial(3,4,1/8), numer;
@c ===end===
@example
(%i1) load (distrib)$
(%i2) cdf_negative_binomial(3,4,1/8);
                                             1
(%o2)            cdf_negative_binomial(3, 4, -)
                                             8
(%i3) cdf_negative_binomial(3,4,1/8), numer;
(%o3)                  .006238937377929698
@end example
@end deffn


@deffn {Fun@value{cedilha}@~ao} quantile_negative_binomial (@var{q},@var{n},@var{p})
Retorna o @var{q}-quantile of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer; em outras palavras, essa função é a inversa da função @code{cdf_negative_binomial}. O
argumento @var{q} must
be
an element of @math{[0,1]}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} mean_negative_binomial (@var{n},@var{p})
Retorna a média de uma @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} var_negative_binomial (@var{n},@var{p})
Retorna o variance of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} std_negative_binomial (@var{n},@var{p})
Retorna o desvio padrão of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} skewness_negative_binomial (@var{n},@var{p})
Retorna o coeficiente de assimetria of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@deffn {Fun@value{cedilha}@~ao} kurtosis_negative_binomial (@var{n},@var{p})
Retorna o coeficiente de curtose of a @math{Negative Binomial(n,p)} vari@'avel aleat@'oria, com @math{0<p<1} and @math{n} a positive integer. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn


@defvr {Variável de opção} random_negative_binomial_algorithm
Valor padrão: @code{bernoulli}

Esse é o algorítmo selecionado para simular random negative binomial variates. Algorítmos implementados são @code{devroye}, @code{bernoulli} and @code{inverse}:
@itemize @bullet

@item
@code{devroye}, baseado no algorítmo descrito em Devroye, L. (1986) @var{Non-Uniform Random Variate Generation}. Springer Verlag, p. 480.

@item
@code{bernoulli}, based on simulation of Bernoulli trials.

@item
@code{inverse}, baseado no método inverso geral.

@end itemize

Veja também @code{random_negative_binomial}.
@end defvr


@deffn {Fun@value{cedilha}@~ao} random_negative_binomial (@var{n},@var{p})
@deffnx {Fun@value{cedilha}@~ao} random_negative_binomial (@var{n},@var{p},@var{m})
Retorna um @math{Negative Binomial(n,p)} random variate, com @math{0<p<1} and @math{n} a positive integer. Chamando @code{random_negative_binomial} com um terceiro argumento @var{m}, uma amostra aleatória de tamanho @var{m} irá
ser simulada.

Existem três algorítmos implementados para essa fun@,{c}@~ao, se pode selecionar o algorítmo a ser usado fornecendo um certo valor à variável global @code{random_negative_binomial_algorithm}, cujo valor padrão é @code{bernoulli}.

Veja também @code{random_negative_binomial_algorithm}. Para fazer uso dessa fun@,{c}@~ao, escreva primeiramente @code{load(distrib)}.
@end deffn
